/*******************************************************************
文件名称：LED_test.c
功能说明：LED测试驱动
编写：张锡冰 阿呆的游乐园 河北大学
时间：2010/8/18
修改记录：无
其他说明：FL2440 LED接口如下：
		  LED0  -> GPB5
		  LED1  -> GPB6
		  LED2  -> GPB8
		  LED10 -> GPB10
		  版权所有，盗版请注明出处
*******************************************************************/

#include	<includes.h>
#include	"LED_test.h"



/*******************************************************************
函数名称：LED_IO_init()
功能说明：完成GPIOF3456引脚的输出模式初始化
入口参数：无
出口参数：无
编写：张锡冰 阿呆的游乐园 河北大学
时间：2010/8/17
修改记录：无
其他说明：版权所有，盗版请注明出处
*******************************************************************/
void LED_IO_init(void)
{
	rGPBCON &= ~(((0x3<<20) | (0x3<<16) | (0x3<<12) | (0x3<<10)));		//清除5,6,8,10引脚设置
	rGPBCON |= ((0x1<<20) | (0x1<<16) | (0x1<<12) | (0x1<<10));			//将GPB5,6,8,10引脚设置为输出状态
	rGPBDAT |= ((0x1<<10) | (0x1<<8) | (0x3<<5));	//熄灭LED
	rGPBDAT&=0xffe;		//关闭蜂鸣器
	rGPBUP = 0x00; 
}


/*******************************************************************
函数名称：LED_negate()
功能说明：取反相应LED
入口参数：INT8U LEDNUM(1-4共4颗LED)
出口参数：无
编写：张锡冰 阿呆的游乐园 河北大学
时间：2010/8/18
修改记录：无
其他说明：版权所有，盗版请注明出处
*******************************************************************/
void LED_negate(U8 LedNum)
{
	U16 LedMask;
	switch(LedNum)
	{
		case 1:	LedMask = (0x1<<5);		break;
		case 2:	LedMask = (0x1<<6);		break;
		case 3:	LedMask = (0x1<<8);		break;
		case 4:	LedMask = (0x1<<10);	break;
		default:break; 
	}
	rGPBDAT ^= LedMask;			//对相应的LED取反
}

/*******************************************************************
函数名称：LED_flow()
功能说明：LED流水灯
入口参数：INT8U LEDNUM(1-4共4颗LED)
出口参数：无
编写：张锡冰 阿呆的游乐园 河北大学
时间：2010/8/18
修改记录：无
其他说明：版权所有，盗版请注明出处
*******************************************************************/
void LED_flow(void)
{
	while (1)			// 死循环
	{
		
		rGPBDAT = ~(1<<5);	//LED0亮
		Delay(500);
		rGPBDAT = ~(1<<6);	//LED1亮
		Delay(500);
		rGPBDAT = ~(1<<8);	//LED2亮
		Delay(500);
		rGPBDAT = ~(1<<10);	//LED3亮
		Delay(500);
	}

}
/*------------------------------------------------------------/
函数名称：	Delay
功能描述：	延时函数
传    参：	int x
返 回 值：	无
-------------------------------------------------------------*/
void Delay(int x)  
{
 	int k, j;
 	while(x)
 	{
 		for (k=0;k<=0xff;k++)
 			for(j=0;j<=0xff;j++);
 			
 		x--;
 	}
}


