/*
*********************************************************************************************************
* 文件: Touch_Screen.C
* 描述: 此处函数 GUI 中定义了,但此次移植并未使用.
* 编写: 深思 (001-12345@sohu.com).
*********************************************************************************************************
*/
#include "config.h"

extern int xdata,ydata;

void GUI_TOUCH_X_ActivateX(void)
{
}

void GUI_TOUCH_X_ActivateY(void)
{
}

void TOUCH_X_Disable(void)   {}

int  GUI_TOUCH_X_MeasureX(void)
{
    return xdata ; //返回触摸坐标x
}

int  GUI_TOUCH_X_MeasureY(void)
{
    return ydata; //返回触摸坐标x
}

/*
********************************************************************************************************
* End.
********************************************************************************************************
*/
