/*********************************************************************
文件名称：os_timer4_c
功能说明：uCos-II系统心跳相关代码，此次移植使用无输出的Timer4做系统心跳
		  计时器
编写：张锡冰 阿呆的游乐园 河北大学
日期：2010/8/18
修改记录：无
其他说明：版权所有，盗版请注明出处
	    于 保定飞凌嵌入式
*********************************************************************/

#include <includes.h>
/*
#include "ucos_ii.h"
#include "2440addr.h"
#include "def.h"
#include "option.h"
*/



/*********************************************************************
函数名称：Timer4_init
功能说明：初始化系统计时器Timer4
入口参数：无
出口参数：无
编写：张锡冰 阿呆的游乐园 河北大学
日期：2010/8/18
修改记录：无
其他说明：版权所有，盗版请注明出处
	    于 保定飞凌嵌入式
*********************************************************************/
void Timer4_init(void)
{
	// 定时器设置
	rTCON &=  (~(0x7<<20));				// clear manual update bit, stop Timer4
	
	
	rTCFG0 &= (~(0xff<<8));					// clr Timer 2&3&4 prescaler 
	rTCFG0 |= (15<<8);						// set Timer 2&3&4 prescaler = 15+1

	rTCFG1 	&= (~(0xf<<16));				// clr Timer 4 MUX 1/4
	rTCFG1  |= (0x1<<16);					// set Timer 4 MUX 1/4
    
	rTCNTB4 = (PCLK / (4 *15* OS_TICKS_PER_SEC)) - 1;	   //PCLK宏用50000代替，以后需要更换回来-------
 
    
  	rTCON &= ~(0x7<<20); 
	rTCON |= (0x1<<21);   	//更新TCNTB4 		
	rTCON &= ~(0x7<<20);
	rTCON |= (0x5<<20); 	//设置为自动重装入模式，并启动定时器
 }
 
 
 

/*********************************************************************************************************
system IsrInit
********************************************************************************************************/
extern void OSTickISR(void);    //在OS_CPU_a.s中定义


void OSTickISRInit(void)
{
	// 设置中断控制器
	rPRIORITY = 0x00000000;			// 使用默认的固定的优先级
	rINTMOD = 0x00000000;			// 所有中断均为IRQ中断
  	pISR_TIMER4= (U32) OSTickISR;
	
	rINTMSK &= ~(1<<14);			//TIMER4中断允许
}


/*********************************************************************
函数名称：OSTickEnable()
功能说明：初始化并使能系统节拍中断
入口参数：无
出口参数：无
编写：张锡冰 阿呆的游乐园 河北大学
日期：2010/8/18
修改记录：无
其他说明：使用无输出引脚的Timer4最系统心跳计时器
		  版权所有，盗版请注明出处
	      于 保定飞凌嵌入式
*********************************************************************/
void OSTickEnable(void)
{
	Timer4_init();			//初始化定时器相关参数
	OSTickISRInit();		//安装中断向量
}	


